<template>
  <div class="container">
    <div class="page">
      <article class="weui-article">
        <h1>到云隐私政策</h1>
        <p>
          版本：1.0.2 发布日期：2020-01-03
        </p>
        <p>
          到云非常重视用户隐私政策并严格遵守相关的法律规定。请您仔细阅读《隐私政策》后再继续使用。如果您继续使用我们的服务，表示您已经充分阅读和理解我们协议的全部内容。
        </p>
        <section>
          <h2 class="title">1. 定义</h2>
          <section>
            <p>
              1.1 我们：是指27组，及由上述小组开发运营的到云软件。
            </p>
            <p>
              1.2 个人信息（出自于 GB/T 35273-2017
              《信息安全技术个人信息安全规范》）：是指以电子或者其他方式记录的能够单独或者与其他信息结合识别特定自然人身份或者反映特定自然人活动情况的各种信息。本隐私政策中涉及的个人信息包括自然人的基本资料（包括姓名、出生年份、性别、电话号码、电子邮箱）、网络身份标识信息（包括系统账号、邮箱地址以及与前述有关的密码）、个人财产信息（包括交易和消费记录、虚拟货币、虚拟交易等虚拟财产信息）、个人上网记录（包括网站浏览记录、软件使用记录、点击记录）、个人常用设备信息（包括硬件序列号、硬件型号、设备
              MAC
              地址、操作系统类型、唯一设备标识符）、个人位置信息（包括大概地理位置、精确定位信息）。我们实际具体收集的个人信息种类以下文描述为准。
            </p>
            <p>
              1.3 个人敏感信息（出自于 GB/T 35273-2017
              《信息安全技术个人信息安全规范》）：是指一旦泄露、非法提供或滥用可能危害人身和财产安全，极易导致个人名誉、身心健康受到损害或歧视性待遇等的个人信息。本隐私政策中涉及的个人敏感信息包括您的个人财产信息、网络身份标识信息、精准定位信息。我们实际具体收集的个人敏感信息种类以下文描述为准。
            </p>
            <p>
              1.4 Cookie ：Cookie
              是包含字符串的小文件，在您登入和使用网站或其他网络内容时发送、存放在您的计算机、移动设备或其他装置内（通常经过加密）。Cookie
              同类技术是可用于与 Cookie 类似用途的其他技术，例如：Web
              Beacon、Proxy、嵌入式脚本等。
            </p>
            <p>
              1.5
              账号：当您注册账号并向我们提供一些个人信息，您就可以更好的使用我们的服务。当您访问到云时，系统会利用这些账号信息对您进行身份验证，以防止未经授权的人员访问您的账号。/p>
            </p>
          </section>
          <section>
            <h3>
              2. 我们如何收集和使用您的信息
            </h3>
            <p>
              2.1
              到云依据法律法规以及遵循正当、合法、必要的原则而收集和使用您在使用服务过程中主动提供或由于产品和/或服务需要而产生的个人信息。如果我们欲将您的个人信息用于本隐私政策未载明的其它用途，或基于特定目的将收集而来的信息用于其他目的，我们会及时以合理的方式向您告知，并在使用前再次征得您的同意。
            </p>

            <p>
              2.2
              我们收集和使用的您的个人信息类型包括两种：第一种：我们产品与/或服务的核心业务功能所必需的信息：此类信息为产品与/或服务正常运行的必备信息，您须授权我们收集。如您拒绝提供，您将无法正常使用我们的产品与/或服务；第二种：附加业务功能可能需要收集的信息：此信息为非核心业务功能所需的信息，您可以选择是否授权我们收集。如您拒绝提供，将导致附加业务功能无法实现或无法达到我们拟达到的效果，但不影响您对核心业务功能的正常使用。
            </p>
            <p>2.3 我们会为实现下述各项功能，收集和使用您的个人信息：</p>
            <p>
              2.3.1
              注册账号：当您注册到云账号时，我们会收集您的手机号码，用于完成注册并保护您的账号安全。手机号码属于敏感信息，收集此项为了以此作为更为高效、可靠的登录凭证。您可以在注册完成后自行决定是否需要完善您的头像、姓名、昵称、性别、出生年份、学校、院系、身份、工号/学号等账号信息。如果您完善以上额外信息，将有助于我们为您提供更好的服务和体验。在上述额外信息中，如果您没有完善姓名和学号/工号信息，将会影响部分功能的使用，例如：创建班课、加入班课。除此之外的其他信息若不提供，不会影响使用产品的基本功能。
            </p>
            <p>
              2.3.2
              当您使用到云充值购买蓝豆（虚拟货币）时，我们会收集您的充值记录、消费记录信息，以便您查询自己的交易记录，同时尽最大程度保护您的财产、虚拟财产安全。上述信息属于敏感信息，但收集上述信息为实现相关功能所必须，否则将无法完成交易。
            </p>
            <p>
              2.3.3
              我们会根据您加入或创建的班课所属课程，为您提供个性化的课程圈推荐，除取得您授权或法律法规另有规定外，我们不会将您的个人信息与您在应用程序中提供的任何个人身份信息相结合，以确保不识别到您个人。
            </p>
            <p>
              2.3.4
              基于相机/摄像头的附加服务：您可在开启相机/摄像头权限后使用拍照上传、更换头像、扫码投屏等功能。
            </p>
            <p>
              2.3.5
              基于相册（图片库/视频库）的图片/视频访问及上传的附加服务：您可以在开启权限后使用相关功能上传您的图片/视频，以实现更换头像、发布图片/视频类资源等功能。
            </p>
            <p>
              2.3.6
              基于麦克风语音技术的附加服务：您使用语音录制上传资源/附件或发送语音消息时，我们会请求您授权麦克风权限，我们会收集您的语音内容，因为收集是实现该功能所必需的。我们会请求您的麦克风权限并收集您的语音内容。
            </p>
            <p>
              2.3.7
              基于文件存储（相册/存储卡读取权限）的图片/视频/本地数据库数据保存的服务：您可以在开启权限后使用相关功能将图片/视频资源保存到您的相册/本地存储中，可以将网络数据缓存到您的本地数据库中，节省数据流量。
            </p>
            <p>
              2.3.8
              当您在使用过程中出现程序崩溃时，为了优化您的使用体验，我们会采集并上报您的崩溃日志，iOS端会采集设备型号、系统版本等信息，安卓端会由腾讯
              Bugly （第三方）收集和反馈您的崩溃信息， Bugly
              会采集您的设备信息。
            </p>
            <p>
              2.3.9
              基于地理位置信息的服务：您使用签到或者设置院系功能时，我们会请求地理位置信息权限，因为获取此项是实现该功能所必需的，在选择学校/院系功能中，我们会将您的地理位置信息传递给高德
              SDK 用于 POI
              搜索，以获取您附近的院校信息。如果您是安卓用户，在使用签到功能时，百度
              SDK
              会获取您的地理位置信息，仅用于计算发起签到的老师与参与签到的学生之间的距离。
            </p>
            <p></p>
          </section>
        </section>
        <section>
          <h2>3. 我们如何使用 Cookie</h2>
          <section>
            <p>
              3.1 在您未拒绝接受 Cookie 的情况下，到云会在您的计算机上设定或取用
              Cookie ，以便您能登录或使用依赖于 Cookie
              的到云平台服务或功能。到云使用 Cookie
              可为您提供更加周到的个性化服务，包括推广服务。
            </p>
            <p>
              3.2 您有权选择接受或拒绝接受 Cookie
              。您可以通过修改浏览器设置的方式拒绝接受 Cookie
              。但如果您选择拒绝接受 Cookie ，您可能无法登录或使用依赖于 Cookie
              的到云网络服务或功能。
            </p>
            <p>3.3 通过到云所设 Cookie 所取得的有关信息，将适用本政策。</p>
          </section>
        </section>

        <section>
          <h2>4. 我们如何共享、转让、公开披露您的信息</h2>
          <section>
            <h3>
              4.1
              到云不会向任何无关第三方提供、出售、出租、分享或交易您的个人登录信息。以下情况除外：
            </h3>
            <p>
              4.1.1 事先已获得您的明确授权或同意；
            </p>
            <p>
              4.1.2
              根据适用的法律法规、法律程序、政府的强制命令或司法裁定而需共享您的个人信息；
            </p>
            <p>
              4.1.3
              在法律要求或允许的范围内，为了保护云班课及其用户或社会公众的利益、财产或安全免遭损害而有必要提供您的个人信息给第三方；
            </p>
            <p>
              4.1.4
              您的个人信息可能会在我们的关联产品之间共享。我们只会共享必要的个人信息，且这种共享亦受本隐私政策声明目的的约束。关联产品如要改变个人信息的处理目的，将再次征求您的授权同意；
            </p>
            <p>
              4.1.5
              为了向您提供更完善、优质的产品和服务，我们的某些服务将由授权第三方提供。我们可能会与第三方共享您的某些个人信息，以提供更好的客户服务和用户体验。我们仅会出于合法、正当、必要、特定、明确的目的共享您的个人信息，并且只会共享提供服务所必要的个人信息。第三方无权将共享的个人信息用于任何其他用途。
              服务商收集和处理信息等行为遵守其自身的隐私条款，而不适用于本政策。为了最大程度保障您的信息安全，我们建议您在使用任何第三方
              SDK 类服务前先行查看其隐私条款。为保障您的合法权益，如您发现这等
              SDK
              或其他类似的应用程序存在风险时，建议您立即终止相关操作并及时与我们取得联系。
              如果您拒绝第三方在提供服务时收集为提供服务所必须的个人信息，将可能导致您无法在我们的平台中使用该第三方服务。
              1)
              阿里云提供的服务：当您注册云班课账号或使用短信验证码登录功能，以及忘记密码等需要获取短信验证码以核验您的身份的功能时，我们委托阿里云服务向您发送短信验证码以完成核验，此过程中阿里云服务会获取您的手机号码；
              2) 高德地图/百度地图提供的服务：您在选择学校/院系功能时，高德地图
              SDK 需要读取您的位置信息来为您提供定位和 POI
              搜索服务；如果您是安卓用户并使用签到功能时，百度地图 SDK
              需要读取您的位置信息来为您提供定位服务； 3) 友盟、微博、微信、腾讯
              QQ
              提供的服务：您可以将云班课的内容分享到第三方平台，如微博、微信朋友圈、微信好友、QQ
              空间、QQ 好友，其 SDK
              可能会收集您提供的信息，这些第三方平台统一使用友盟分享 SDK
              管理，友盟 SDK 可能需要读取您的设备信息; 4) TalkingData
              提供的服务：我们使用由第三方 TalkingData
              提供的统计分析服务，TalkingData 可能需要读取您的设备信息; 5)
              极光推送提供的服务：我们使用由极光推送（第三方）提供的推送服务用于推送/下发通知栏消息，极光推送SDK在注册时需要读取您的设备信息；
              6) 环信提供的服务：当您在使用讨论/答疑或私聊功能时，我们使用了环信
              SDK 为您提供即时通信服务，环信 SDK
              可能会读取您的设备信息，您在使用私聊或讨论答疑功能发送语音消息时，环信
              SDK 会获取并保存您的语音内容，用于发送给指定方以及查看历史记录；
              7)
              百度语音提供的服务：当您使用班课列表语音控制功能或课堂表现语音评分功能时，百度语音
              SDK
              会获取您的语音内容进行识别，帮助我们了解您的语音指令意图，此过程中可能需要读取您的设备信息；
              8)
              微信支付/支付宝提供的服务：在安卓设备中，当您使用微信支付或支付宝支付购买蓝豆时，为了让您完成交易、实现交易目的，微信支付
              SDK 和支付宝 SDK 需要读取您的 IMEI 信息； 9)
              腾讯Bugly提供的服务：我们会使用腾讯 Bugly SDK
              来统计安卓用户在使用我们产品或服务过程中出现的崩溃或无响应等状况，Bugly
              SDK 可能需要读取您的设备信息。
            </p>
            <h3>
              4.2
              云班课亦不允许任何第三方以任何手段恶意收集、编辑、出售或者无偿传播您的个人信息。任何云班课平台用户如从事上述活动，一经发现，云班课有权立即终止与该用户的服务协议。
            </h3>
            <h3>
              4.3
              如果我们的存储发生维修或升级，我们会事先发出推送消息来通知您，请您提前允许云班课消息通知。
            </h3>
          </section>
        </section>
      </article>
    </div>
  </div>
</template>

<style scoped>
.container {
  position: absolute;
  top: 0;
  right: 0;
  bottom: 0;
  left: 0;
  overflow: scroll;
  color: var(--weui-FG-0);
}
.article {
  position: absolute;
  top: 0;
  right: 0;
  bottom: 0;
  left: 0;
  overflow-y: auto;
  -webkit-overflow-scrolling: touch;
  box-sizing: border-box;
  opacity: 0;
  z-index: 1;
}
</style>
